[{"date": "2021-03-11", "title": "Oprah’s oversized royal interview glasses spark Swiss specs frenzy", "article": "A family gather around the television in Liverpool, north west England to watch Prince Harry and his wife Meghan’s explosive tell-all interview on CBS with Oprah Winfrey, on March 8, 2021, as nationa… [+2725 chars]", "author": null}, {"date": "2021-03-11", "title": "Irked Thai PM ‘sanitizes’ journalists", "article": "VEXED Thai Prime Minister Prayuth Chan-ocha sprays hand sanitizer at front row journalists to avert answering questions on the latest Cabinet reshuffle in Bangkok, Thailand, on Tuesday. REUTERS\r\nBANG… [+1702 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Sinas tests positive for coronavirus", "article": "Gen. Debold Sinas, the chief of the Philippine National Police, has tested positive for the coronavirus.\r\nBut Brig. Gen. Ildebrandi Usana, speaking for the PNP on Thursday, said there was nothing to … [+1412 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "One year in lockdown", "article": "This week marks a whole year since the start of the lockdown and the traumatic months that followed, during which we were trapped both physically and emotionally, gripped with uncertainty and fear, s… [+5059 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Red-tagging is the new witch-hunting", "article": null, "author": "clopez"}, {"date": "2021-03-11", "title": "Pandemic reality check", "article": "A recent Lancet article about the launch of a COVID-19 Scenarios Project said that the pandemic will not be over anytime soon. In the medium and long terms, or about 3-5 years, a range of different s… [+4565 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Give way to those in priority list", "article": "With the rollout of the vaccines for COVID-19 last week, the top priority recipients are health care workers in government and private hospitals, particularly those with COVID wards. Some have receiv… [+2516 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Lawyer finds her love language in cooking", "article": "I never thought my family could love me more. Not until I learned how to cook and found out that cooking is an act of love and a voluntary servitude that says more than I love you.\r\nI never really wa… [+4989 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Filipina up for Female Chef of the Year at World Gourmet Awards", "article": "Chef Johanne Siy\r\nJohanne Siy is the head chef of Lolla in Singapore and a Female Chef of the Year nominee of World Gourmet Awards, Singapore.\r\nSiys cuisine is eclectic, a reflection of herself as a … [+4863 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "Remembering Mang Ben", "article": "Ben Farrales with (fromleft) models/beauty queens Desiree Verdadero, Lou Bunyi, Selina Manalad and Patty Betita PATTY BETITA\r\nEsteemed designer Ben Farrales, who gained a reputation for his deft use … [+5864 chars]", "author": "clopez"}, {"date": "2021-03-11", "title": "France eases COVID-19 restrictions on international travel", "article": "FILE PHOTO: An information board is displayed at the Eurostar terminal at Gare du Nord train station, amidst the coronavirus disease (COVID-19) pandemic, in Paris, France December 23, 2020. REUTERS/B… [+2212 chars]", "author": "INQUIRER.net"}, {"date": "2021-03-11", "title": "Philippines to get 30 million doses of Novavax jab by Q2-Q3, says envoy", "article": "MANILA, Philippines The Philippines might receive 30 million doses of the COVID-19 vaccine developed by American firm Novavax, which is being manufactured in India, in the late second quarter or earl… [+2413 chars]", "author": "postie"}, {"date": "2021-03-11", "title": "Duterte to police, military: Go after people faking COVID-19 test results", "article": null, "author": "postie"}, {"date": "2021-03-11", "title": "‘We’re not racist’, says Prince William after Meghan and Harry interview", "article": "FILE PHOTO: Britain’s Prince William and Prince Harry attend the opening of the Greenhouse Sports Centre in central London, April 26, 2018. REUTERS/Toby Melville/Pool/File Photo\r\nLONDON Prince Willia… [+3046 chars]", "author": "kadraneda"}, {"date": "2021-03-11", "title": "Duterte bent on reopening economy soon even as COVID-19 cases in PH continue to rise", "article": "MANILA, Philippines Despite the persistently increasing number of COVID-19 infections in the country, President Rodrigo Duterte on Thursday said that he has to reopen the economy in “a timetable of j… [+3349 chars]", "author": "postie"}, {"date": "2021-03-11", "title": "What you need to know about the Johnson & Johnson vaccine", "article": "(FILES) In this file photo taken on March 5, 2021, registered nurse Florisa N. Lingad holds a Johnson &amp; Johnson Covid-19 vaccine at a vaccination center established at the Hilton Chicago O’Hare A… [+5244 chars]", "author": "kadraneda"}, {"date": "2021-03-11", "title": "Palace: PH inoculates over 114,500 people vs COVID-19 as of March 10", "article": "A health worker prepares a Sinovac COVID-19 vaccine during the first phase of vaccinations for health workers at a hospital in Manila on March 1, 2021. (Photo by Ted ALJIBE / AFP)\r\nMANILA, Philippine… [+1666 chars]", "author": "Daphne Galvez"}, {"date": "2021-03-11", "title": "Myanmar junta accuses Suu Kyi of taking bribes as eight killed in anti-coup protests", "article": null, "author": "dmorcoso"}, {"date": "2021-03-11", "title": "Passengers  bound for Iloilo City need to submit negative swab test result", "article": "BACOLOD CITY All passengers arriving in Iloilo City, except those from neighboring Western Visayas areas, will be required to submit a negative swab test result issued not more than 72 hours before t… [+1573 chars]", "author": "dmorcoso"}, {"date": "2021-03-11", "title": "Gov’t hospitals in Eastern Visayas begin COVID-19 jabs", "article": "TACLOBAN CITY Various government-run hospitals in Eastern Visayas have started their coronavirus disease (COVID-19) vaccination program for healthcare workers.\r\nThe Northern Samar provincial hospital… [+2587 chars]", "author": "Joey Gabieta"}, {"date": "2021-03-11", "title": "Biden says Americans will be first to get vaccines; any surplus to be shared", "article": "U.S. President Joe Biden announces administration plans to double its order of the single-shot Johnson &amp; Johnson coronavirus vaccine, procuring an additional 100 million doses, during an event wi… [+2814 chars]", "author": "kadraneda"}, {"date": "2021-03-11", "title": "Joyce Pring on strength of pregnant women: ‘We really have no idea’", "article": "Actress Joyce Pring has been into reading lately, and from it, she learned something about childbirth which she hopes mothers would appreciate.\r\nAs she spoke about her learnings, Pring showed a short… [+1669 chars]", "author": "jbalboa"}, {"date": "2021-03-11", "title": "China will continue to work with WHO to seek COVID-19 origins – premier", "article": "(FILE PHOTO) Chinese Premier Li Keqiang speaks during a press conference after the closing session of the National People’s Congress in Beijing’s Great Hall of the People on Friday, March 15, 2019. (… [+1242 chars]", "author": "Reuters"}, {"date": "2021-03-11", "title": "CHR to help gov’t resolve activist killings but insists on danger of red-tagging", "article": null, "author": null}, {"date": "2021-03-11", "title": "Vaccine hope, but enduring fear one year after pandemic declared", "article": "This photograph taken on January 4, 2021, in Paris, shows figurines next to a vaccine vial reading “COVID-19 vaccine”. (Photo by JOEL SAGET / AFP)\r\nBrasília, Brazil The world on Thursday marked one y… [+5549 chars]", "author": "kadraneda"}, {"date": "2021-03-11", "title": "5.7-magnitude quake rocks Zambales", "article": null, "author": null}, {"date": "2021-03-11", "title": "NTC pinagpapaliwanag kaugnay sa alegasyong may aberya sa technical audit ng Dito", "article": "Dapat sagutin ng National Telecommunications Commission (NTC) ang alegasyon ng isang IT advocacy group hinggil sa technical audit nito sa Dito Telecommunity, ayon kay Senadora Risa Hontiveros.\r\nIf th… [+1835 chars]", "author": "Dennis Maliwanag"}, {"date": "2021-03-11", "title": "Pandemic crippling nature conservation efforts", "article": "This photo taken on November 20, 2014, shows an aerial view of the Great Barrier Reef off the coast of the Whitsunday Islands, along the central coast of Queensland. The Great Barrier Reef Marine Par… [+5405 chars]", "author": "kadraneda"}, {"date": "2021-03-11", "title": "Sam Milby on last taping days of ‘Ang sa Iyo ay Akin’: ‘It’s so hard to shoot’", "article": null, "author": "jbalboa"}, {"date": "2021-03-11", "title": "Buhing Kalbaryo will be streamed online again", "article": null, "author": "dletigio"}, {"date": "2021-03-11", "title": "Chanel parties it up in ski salopettes for fashion week", "article": "PARIS (Reuters) – Ski lifts may be closed in France due to COVID-19 restrictions, but Chanel recreated a winter resort ambiance on Tuesday with a collection featuring quilted salopettes and faux fur … [+1724 chars]", "author": "oestrada"}, {"date": "2021-03-11", "title": "Olongapo logs 6 new COVID-19 cases", "article": "OLONGAPO CITY Six new cases of the coronavirus disease (COVID-19) were recorded in this city on Wednesday, raising its total number of patients to 1,076 since last year.\r\nIn a statement, Mayor Rolen … [+1100 chars]", "author": "dmorcoso"}, {"date": "2021-03-11", "title": "Quezon taps peoples’ groups in COVID-19 vaccination drive", "article": "LUCENA CITY The provincial government of Quezon has tapped the help of peoples organizations to address the widespread public skepticism on the coronavirus disease (COVID-19) vaccination program.\r\nJa… [+3252 chars]", "author": "Delfin T. Mallari Jr."}, {"date": "2021-03-11", "title": "Hope, fear, doubts mark initial vaccine rollout in Mindanao", "article": "MLANG, COTABATO Amid her fear of adverse effects, a medical doctor braved the first shots of the CoronaVac on the first day of the vaccine rollout here on Monday and heaved a sigh of relief when she … [+5245 chars]", "author": "Aquiles Zonio, Divina Suson with reports from Rommel Rebollido, Williamor Magbanua"}, {"date": "2021-03-11", "title": "Boy, prisoner, 2 elderlies contract COVID-19 in San Pablo City", "article": "LUCENA CITY - A year-old boy, a jail inmate, and two elderlies were among the 12 new coronavirus disease (COVID-19) patients recorded in San Pablo City in Laguna province on Wednesday, local authorit… [+1505 chars]", "author": "lboniol"}, {"date": "2021-03-11", "title": "BAFTA nominations see diversity push, ‘Nomadland’ and ‘Rocks’ lead nods", "article": "LONDON (Reuters) – U.S. recession drama “Nomadland” and coming-of-age story “Rocks” led the nominations for the British Academy of Film and Television Arts (BAFTA) awards on Tuesday with seven nods e… [+2570 chars]", "author": "oestrada"}, {"date": "2021-03-11", "title": "St. Luke’s Medical Center promotes holistic wellness", "article": "Health is wealth this is what people tell us so that we take care of ourselves in order to live long and enjoy life to the fullest. As we look for ways to stay healthy, it is important to have an all… [+3987 chars]", "author": "ilucas"}, {"date": "2021-03-11", "title": "DTI office in Oriental Mindoro on temporary lockdown", "article": "CITY OF CALAPAN The Department of Trade and Industry (DTI) provincial office in Oriental Mindoro based in this city has been placed on temporary lockdown starting on Wednesday, March 10, until March … [+1717 chars]", "author": "Madonna Virola"}, {"date": "2021-03-11", "title": "Royal family contests Harry and Meghan’s racism claims", "article": "Britain’s Prince Harry and Meghan, Duchess of Sussex, are interviewed by Oprah Winfrey in this undated handout photo. Harpo Productions/Joe Pugliese/Handout via REUTERS\r\nLONDON Britain’s royal family… [+5141 chars]", "author": "dlejano"}, {"date": "2021-03-11", "title": "Royal family contests Harry and Meghan’s racism claims", "article": null, "author": null}, {"date": "2021-03-11", "title": "Rainy weather expected over Cebu due to LPA", "article": null, "author": "dmondragon"}, {"date": "2021-03-11", "title": "UK royal crisis: ‘Firm’ safe for now but clouds loom", "article": null, "author": "dlejano"}, {"date": "2021-03-11", "title": "San Juan logs 133 new active COVID-19 cases in 10 days", "article": "The implementation of the curfew is basically a psychological  reminder to people that Hey, guys, were experiencing a spike, please change your mindset, do not relax, do not be confident just because… [+769 chars]", "author": "postie"}]