{"status": "ok", "totalResults": 43, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Oprah’s oversized royal interview glasses spark Swiss specs frenzy", "description": "ZURICH, Switzerland - Swiss spectacles manufacturer Gotti said Thursday they had been inundated with demand for the oversized glasses worn by Oprah Winfrey for her TV interview with Britain's Prince Harry and his wife Meghan.\n\nThe small Zurich-based brand, wh…", "url": "https://lifestyle.inquirer.net/?p=380302", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/000_94R94U-scaled.jpg", "publishedAt": "2021-03-11T23:11:25Z", "content": "A family gather around the television in Liverpool, north west England to watch Prince Harry and his wife Meghan’s explosive tell-all interview on CBS with Oprah Winfrey, on March 8, 2021, as nationa… [+2725 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Irked Thai PM ‘sanitizes’ journalists", "description": "BANGKOK—Thai Prime Minister Prayuth Chan-ocha left reporters stunned and amused on Tuesday when he interrupted his own news conference to spray them with hand sanitizer in a bid to dodge tough questions. Prayuth became frustrated when asked about a list of po…", "url": "https://newsinfo.inquirer.net/1406027/irked-thai-pm-sanitizes-journalists", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/News131138-620x413.jpg", "publishedAt": "2021-03-11T21:50:03Z", "content": "VEXED Thai Prime Minister Prayuth Chan-ocha sprays hand sanitizer at front row journalists to avert answering questions on the latest Cabinet reshuffle in Bangkok, Thailand, on Tuesday. REUTERS\r\nBANG… [+1702 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Sinas tests positive for coronavirus", "description": "Gen. Debold Sinas, the chief of the Philippine National Police, has tested positive for the coronavirus. But Brig. Gen. Ildebrandi Usana, speaking for the PNP on Thursday, said there was nothing to worry about Sinas’ condition.“Just send prayers for the chief…", "url": "https://newsinfo.inquirer.net/1406008/sinas-tests-positive-for-coronavirus", "urlToImage": "https://newsinfo.inquirer.net/files/2020/11/sinas-23nov2020-1-e1606125405361-620x465.jpg", "publishedAt": "2021-03-11T21:38:17Z", "content": "Gen. Debold Sinas, the chief of the Philippine National Police, has tested positive for the coronavirus.\r\nBut Brig. Gen. Ildebrandi Usana, speaking for the PNP on Thursday, said there was nothing to … [+1412 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "One year in lockdown", "description": "This week marks a whole year since the start of the lockdown and the traumatic months that followed, during which we were trapped both physically and emotionally, gripped with uncertainty and fear, subjected to the wisdom, mercy, and oftentimes neither, of ou…", "url": "https://opinion.inquirer.net/138426/one-year-in-lockdown", "urlToImage": "https://opinion.inquirer.net/files/2017/11/GIDEON-LASCO-SECOND-OPINION-800x418.jpg", "publishedAt": "2021-03-11T21:07:42Z", "content": "This week marks a whole year since the start of the lockdown and the traumatic months that followed, during which we were trapped both physically and emotionally, gripped with uncertainty and fear, s… [+5059 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Red-tagging is the new witch-hunting", "description": "In a social media viral meme, a girl laments, “I do not know why we were taught to fear the witches rather than the people who burn them at the stake.” Now we wonder why the original witch hunts continue in the form of red-tagging. In lieu of the religious, m…", "url": "https://opinion.inquirer.net/138418/red-tagging-is-the-new-witch-hunting", "urlToImage": null, "publishedAt": "2021-03-11T21:04:49Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Pandemic reality check", "description": "A recent Lancet article about the launch of a COVID-19 Scenarios Project said that the pandemic will not be over anytime soon. In the medium and long terms, or about 3-5 years, a range of different scenarios will play out, and most of them are not necessarily…", "url": "https://opinion.inquirer.net/138416/pandemic-reality-check", "urlToImage": "https://www.inquirer.net/wp-content/uploads/2016/10/new-inq-fb-def.jpg", "publishedAt": "2021-03-11T21:03:44Z", "content": "A recent Lancet article about the launch of a COVID-19 Scenarios Project said that the pandemic will not be over anytime soon. In the medium and long terms, or about 3-5 years, a range of different s… [+4565 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Give way to those in priority list", "description": "With the rollout of the vaccines for COVID-19 last week, the top priority recipients are health care workers in government and private hospitals, particularly those with COVID wards. Some have received the vaccine that is available, while others are opting to…", "url": "https://opinion.inquirer.net/138412/give-way-to-those-in-priority-list", "urlToImage": "https://www.inquirer.net/wp-content/uploads/2016/10/new-inq-fb-def.jpg", "publishedAt": "2021-03-11T21:01:37Z", "content": "With the rollout of the vaccines for COVID-19 last week, the top priority recipients are health care workers in government and private hospitals, particularly those with COVID wards. Some have receiv… [+2516 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Lawyer finds her love language in cooking", "description": "I never thought my family could love me more. Not until I learned how to cook and found out that cooking is an act of love and a voluntary servitude that says more than “I love you.” I never really wanted to cook. There was just no reason to. My mother, Teres…", "url": "https://lifestyle.inquirer.net/380297/lawyer-finds-her-love-language-in-cooking/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Lifestyle130500-scaled-e1615485471757.jpg", "publishedAt": "2021-03-11T18:02:28Z", "content": "I never thought my family could love me more. Not until I learned how to cook and found out that cooking is an act of love and a voluntary servitude that says more than I love you.\r\nI never really wa… [+4989 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Filipina up for Female Chef of the Year at World Gourmet Awards", "description": "Johanne Siy is the head chef of Lolla in Singapore and a Female Chef of the Year nominee of World Gourmet Awards, Singapore. Siy’s cuisine is eclectic, a reflection of herself as a Filipina who was educated in culinary school in New York, then wandered and co…", "url": "https://lifestyle.inquirer.net/380292/filipina-up-for-female-chef-of-the-year-at-world-gourmet-awards/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Lifestyle130480-e1615485021946.jpg", "publishedAt": "2021-03-11T17:52:09Z", "content": "Chef Johanne Siy\r\nJohanne Siy is the head chef of Lolla in Singapore and a Female Chef of the Year nominee of World Gourmet Awards, Singapore.\r\nSiys cuisine is eclectic, a reflection of herself as a … [+4863 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Remembering Mang Ben", "description": "Esteemed designer Ben Farrales, who gained a reputation for his deft use of Mindanao fabrics that he fashioned into evening gowns, died on March 6. He was 88. His grandniece announced her uncle’s passing on social media. “Mang Ben to his protégées, associates…", "url": "https://lifestyle.inquirer.net/380285/remembering-mang-ben/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Lifestyle130176.jpg", "publishedAt": "2021-03-11T17:41:52Z", "content": "Ben Farrales with (fromleft) models/beauty queens Desiree Verdadero, Lou Bunyi, Selina Manalad and Patty Betita PATTY BETITA\r\nEsteemed designer Ben Farrales, who gained a reputation for his deft use … [+5864 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "INQUIRER.net", "title": "France eases COVID-19 restrictions on international travel", "description": "PARIS --- France will ease some COVID-19 restrictions on international travel outside Europe, the foreign ministry said Thursday.\n\nThe ministry said in a statement that travelers to or from Australia, New Zealand, South Korea, Israel, Japan, Britain, and Sing…", "url": "https://newsinfo.inquirer.net/1405979/france-eases-covid-19-restrictions-on-international-travel", "urlToImage": "https://newsinfo.inquirer.net/files/2020/12/2020-12-25T184106Z_1_LYNXMPEGBO0G2_RTROPTP_4_HEALTH-CORONAVIRUS-FRANCE-620x413.jpg", "publishedAt": "2021-03-11T14:24:54Z", "content": "FILE PHOTO: An information board is displayed at the Eurostar terminal at Gare du Nord train station, amidst the coronavirus disease (COVID-19) pandemic, in Paris, France December 23, 2020. REUTERS/B… [+2212 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "postie", "title": "Philippines to get 30 million doses of Novavax jab by Q2-Q3, says envoy", "description": "MANILA, Philippines — The Philippines might receive 30 million doses of the COVID-19 vaccine developed by American firm Novavax, which is being manufactured in India, in the late second quarter or early third quarter of the year once agreements are signed, In…", "url": "https://newsinfo.inquirer.net/?p=1405960", "urlToImage": "https://newsinfo.inquirer.net/files/2020/05/000_1RI371-620x417.jpg", "publishedAt": "2021-03-11T14:17:06Z", "content": "MANILA, Philippines The Philippines might receive 30 million doses of the COVID-19 vaccine developed by American firm Novavax, which is being manufactured in India, in the late second quarter or earl… [+2413 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "postie", "title": "Duterte to police, military: Go after people faking COVID-19 test results", "description": "MANILA, Philippines — President Rodrigo Duterte on Thursday said he will order the police and military to go after people who are faking their COVID-19 test results to circumvent restrictions. He said he will also go after people who are buying COVID-19 vacci…", "url": "https://newsinfo.inquirer.net/1405957/duterte-to-police-military-go-after-people-faking-covid-19-test-results", "urlToImage": null, "publishedAt": "2021-03-11T14:05:21Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "‘We’re not racist’, says Prince William after Meghan and Harry interview", "description": "LONDON — Prince William said Thursday that Britain’s royals were not racist after Meghan, wife of his younger brother Harry, said one unnamed member of the family had asked how dark their son Archie’s skin might be. Meghan, 39, made the allegation during an e…", "url": "https://lifestyle.inquirer.net/380277/were-not-racist-says-prince-william-after-meghan-and-harry-interview/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/2021-03-11T121928Z_1_LYNXMPEH2A0XS-ORVTV_RTROPTP_4_TELEVISION-US-BRITAIN-ROYALS-MEGHAN-scaled.jpg", "publishedAt": "2021-03-11T13:02:20Z", "content": "FILE PHOTO: Britain’s Prince William and Prince Harry attend the opening of the Greenhouse Sports Centre in central London, April 26, 2018. REUTERS/Toby Melville/Pool/File Photo\r\nLONDON Prince Willia… [+3046 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "postie", "title": "Duterte bent on reopening economy soon even as COVID-19 cases in PH continue to rise", "description": "MANILA, Philippines — Despite the persistently increasing numbers of COVID-19 infections in the country, President Rodrigo Duterte on Thursday said that he has to reopen the economy in “a timetable of just weeks” because “we cannot forever be in the strict pr…", "url": "https://newsinfo.inquirer.net/1405901/duterte-bent-on-reopening-economy-soon-even-as-covid-19-cases-in-ph-continue-to-rise", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/duterte-dumaguete2-620x345.png", "publishedAt": "2021-03-11T12:23:44Z", "content": "MANILA, Philippines Despite the persistently increasing number of COVID-19 infections in the country, President Rodrigo Duterte on Thursday said that he has to reopen the economy in “a timetable of j… [+3349 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "What you need to know about the Johnson & Johnson vaccine", "description": "Washington, United States — Johnson & Johnson’s (J&J) single-dose COVID-19 shot is expected to be authorized by the European Union on Thursday, the bloc’s fourth vaccine in the fight to end its chapter of the pandemic. Here’s what you need to know. How safe a…", "url": "https://newsinfo.inquirer.net/1405837/what-you-need-to-know-about-the-johnson-johnson-vaccine", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/JJ-covid-vaccine.jpg", "publishedAt": "2021-03-11T10:48:19Z", "content": "(FILES) In this file photo taken on March 5, 2021, registered nurse Florisa N. Lingad holds a Johnson &amp; Johnson Covid-19 vaccine at a vaccination center established at the Hilton Chicago O’Hare A… [+5244 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Daphne Galvez", "title": "Palace: PH inoculates over 114,500 people vs COVID-19 as of March 10", "description": "MANILA, Philippines --- The Philippines has so far vaccinated more than 114,500 individuals against COVID-19, Malacaang said Thursday.\n\nPresidential spokesman Harry Roque said that as of Wednesday, 114,615 people have been inoculated against the potentially d…", "url": "https://newsinfo.inquirer.net/1405856/palace-ph-inoculates-over-114500-people-vs-covid-19-as-of-march-10", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/000_93Z6JY-620x413.jpg", "publishedAt": "2021-03-11T10:24:12Z", "content": "A health worker prepares a Sinovac COVID-19 vaccine during the first phase of vaccinations for health workers at a hospital in Manila on March 1, 2021. (Photo by Ted ALJIBE / AFP)\r\nMANILA, Philippine… [+1666 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dmorcoso", "title": "Myanmar junta accuses Suu Kyi of taking bribes as eight killed in anti-coup protests", "description": "Myanmar’s military government accused deposed leader Aung San Suu Kyi of accepting illegal payments as eight people were killed on Thursday when security forces opened fire on protests against the coup, witnesses and local media said. Rights group Amnesty Int…", "url": "https://newsinfo.inquirer.net/1405860/myanmar-junta-accuses-suu-kyi-of-taking-bribes-as-eight-killed-in-anti-coup-protests", "urlToImage": null, "publishedAt": "2021-03-11T10:12:37Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dmorcoso", "title": "Passengers  bound for Iloilo City need to submit negative swab test result", "description": "BACOLOD CITY –– All passengers arriving in Iloilo City, except those from neighboring Western Visayas areas, will be required to submit a negative swab test result issued not more than 72 hours before the date of travel to the city. Mayor Jerry Treñas issued …", "url": "https://newsinfo.inquirer.net/1405857/passengers-bound-for-iloilo-city-need-to-submit-negative-swab-test-result", "urlToImage": "https://newsinfo.inquirer.net/files/2021/02/cebu-swab-22feb2021-e1613989007890-620x464.jpg", "publishedAt": "2021-03-11T10:08:19Z", "content": "BACOLOD CITY All passengers arriving in Iloilo City, except those from neighboring Western Visayas areas, will be required to submit a negative swab test result issued not more than 72 hours before t… [+1573 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Joey Gabieta", "title": "Gov’t hospitals in Eastern Visayas begin COVID-19 jabs", "description": "TACLOBAN CITY ---- Various government-run hospitals in Eastern Visayas have started their coronavirus disease (COVID-19) vaccination program for healthcare workers.\nThe Northern Samar provincial hospital based in Catarman town received 2,000 doses of Sinovac …", "url": "https://newsinfo.inquirer.net/1405838/govt-hospitals-in-eastern-visayas-begin-covid-19-jabs", "urlToImage": "https://newsinfo.inquirer.net/files/2019/12/eastern_visayas_map-620x901.png", "publishedAt": "2021-03-11T09:42:56Z", "content": "TACLOBAN CITY Various government-run hospitals in Eastern Visayas have started their coronavirus disease (COVID-19) vaccination program for healthcare workers.\r\nThe Northern Samar provincial hospital… [+2587 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "Biden says Americans will be first to get vaccines; any surplus to be shared", "description": "WASHINGTON — The United States government will first give Americans COVID-19 vaccines, but any surplus would be shared with the world, President Joe Biden said Wednesday after earlier announcing plans to procure an additional 100 million doses. “We’re going t…", "url": "https://newsinfo.inquirer.net/1405832/biden-says-americans-will-be-first-to-get-vaccines-any-surplus-to-be-shared", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/2021-03-10T211552Z_1_LYNXMPEH291M0_RTROPTP_4_HEALTH-CORONAVIRUS-BIDEN-620x417.jpg", "publishedAt": "2021-03-11T09:37:26Z", "content": "U.S. President Joe Biden announces administration plans to double its order of the single-shot Johnson &amp; Johnson coronavirus vaccine, procuring an additional 100 million doses, during an event wi… [+2814 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "Joyce Pring on strength of pregnant women: ‘We really have no idea’", "description": "Joyce Pring has been into reading lately, and she learned something which she hopes mothers like her would also appreciate.\nThe post Joyce Pring on strength of pregnant women: ‘We really have no idea’ appeared first on Inquirer Lifestyle.", "url": "https://lifestyle.inquirer.net/380257/joyce-pring-on-strength-of-pregnant-women-we-really-have-no-idea/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/juancho-triviño-ig.png", "publishedAt": "2021-03-11T09:30:58Z", "content": "Actress Joyce Pring has been into reading lately, and from it, she learned something about childbirth which she hopes mothers would appreciate.\r\nAs she spoke about her learnings, Pring showed a short… [+1669 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "China will continue to work with WHO to seek COVID-19 origins – premier", "description": "BEIJING --- Chinese Premier Li Keqiang said Thursday the country would continue to work with the World Health Organization (WHO) in trying to find the origins of COVID-19, the respiratory ailment caused by the new coronavirus SARS-CoV-2.\n\nLi issued the statem…", "url": "https://newsinfo.inquirer.net/1405823/china-will-continue-to-work-with-who-to-seek-covid-19-origins-premier", "urlToImage": "https://newsinfo.inquirer.net/files/2019/03/AP19074113085407-620x413.jpg", "publishedAt": "2021-03-11T09:26:19Z", "content": "(FILE PHOTO) Chinese Premier Li Keqiang speaks during a press conference after the closing session of the National People’s Congress in Beijing’s Great Hall of the People on Friday, March 15, 2019. (… [+1242 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "CHR to help gov’t resolve activist killings but insists on danger of red-tagging", "description": "MANILA, Philippines --- The Commission on Human Rights (CHR) has assured the government that it remains open to help resolve numerous violations of human rights but insists on the danger of red-tagging.\n\nThe CHR said on Thursday that red-tagging or linking ac…", "url": "https://newsinfo.inquirer.net/1405809/chr-to-help-govt-resolve-activist-killings-but-insists-on-danger-of-red-tagging", "urlToImage": null, "publishedAt": "2021-03-11T09:03:38Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "Vaccine hope, but enduring fear one year after pandemic declared", "description": "Brasília, Brazil — The world on Thursday marked one year since the coronavirus threat was declared a pandemic, with vaccinations offering hope but much of humanity still enduring highly restricted lives and no clear path back to normality. The enormity of the…", "url": "https://newsinfo.inquirer.net/1405777/vaccine-hope-but-enduring-fear-one-year-after-pandemic-declared", "urlToImage": "https://newsinfo.inquirer.net/files/2021/01/000_8Y68BX-620x413.jpg", "publishedAt": "2021-03-11T08:51:00Z", "content": "This photograph taken on January 4, 2021, in Paris, shows figurines next to a vaccine vial reading “COVID-19 vaccine”. (Photo by JOEL SAGET / AFP)\r\nBrasília, Brazil The world on Thursday marked one y… [+5549 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "5.7-magnitude quake rocks Zambales", "description": "SAN ANTONIO, Zambales ---- A magnitude 5.7 earthquake jolted this province at 3:24 p.m. on Thursday, the Philippine Institute of Volcanology and Seismology (Phivolcs) reported.\nIn a bulletin issued by Phivolcs, the tectonic earthquake's epicenter was located …", "url": "https://newsinfo.inquirer.net/1405784/5-7-magnitude-quake-rocks-zambales", "urlToImage": null, "publishedAt": "2021-03-11T08:25:27Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Dennis Maliwanag", "title": "NTC pinagpapaliwanag kaugnay sa alegasyong may aberya sa technical audit ng Dito", "description": "Dapat sagutin ng National Telecommunications Commission (NTC) ang alegasyon ng isang IT advocacy group hinggil sa technical audit nito sa Dito Telecommunity, ayon kay Senadora Risa Hontiveros. “If the agency will not be able to do so, it will only add to the …", "url": "https://bandera.inquirer.net/279543/ntc-pinagpapaliwanag-kaugnay-sa-alegasyong-may-aberya-sa-technical-audit", "urlToImage": "https://bandera.inquirer.net/files/2020/05/Risa-Hontiveros.jpg", "publishedAt": "2021-03-11T08:15:24Z", "content": "Dapat sagutin ng National Telecommunications Commission (NTC) ang alegasyon ng isang IT advocacy group hinggil sa technical audit nito sa Dito Telecommunity, ayon kay Senadora Risa Hontiveros.\r\nIf th… [+1835 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "Pandemic crippling nature conservation efforts", "description": "Geneva, Switzerland — The COVID-19 pandemic has not only had devastating effects on humans, it has also heavily impacted efforts to safeguard natural ecosystems and habitats around the globe, conservationists warned Thursday. The pandemic and its economic fal…", "url": "https://newsinfo.inquirer.net/1405762/pandemic-crippling-nature-conservation-efforts", "urlToImage": "https://newsinfo.inquirer.net/files/2020/04/000_Hkg10124608-620x397.jpg", "publishedAt": "2021-03-11T08:12:41Z", "content": "This photo taken on November 20, 2014, shows an aerial view of the Great Barrier Reef off the coast of the Whitsunday Islands, along the central coast of Queensland. The Great Barrier Reef Marine Par… [+5405 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "jbalboa", "title": "Sam Milby on last taping days of ‘Ang sa Iyo ay Akin’: ‘It’s so hard to shoot’", "description": "The last taping was the ultimate challenge for Sam Milby because after they came back from their break, most scenes were heavy.\nThe post Sam Milby on last taping days of ‘Ang sa Iyo ay Akin’: ‘It’s so hard to shoot’ appeared first on Inquirer Lifestyle.", "url": "https://lifestyle.inquirer.net/380250/sam-milby-on-last-taping-days-of-ang-sa-iyo-ay-akin-its-so-hard-to-shoot/", "urlToImage": null, "publishedAt": "2021-03-11T07:23:29Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dletigio", "title": "Buhing Kalbaryo will be streamed online again", "description": "CEBU CITY, Philippines — The yearly Buhing Kalbaryo play organized by Cebu City Vice Mayor Michael Rama will take another year off the streets due to the ongoing Coronavirus Disease 2019 (COVID-19) pandemic. The Buhing Kalbaryo is a pasyon play that recounts …", "url": "https://cebudailynews.inquirer.net/367165/buhing-kalbaryo-will-be-streamed-online-again", "urlToImage": null, "publishedAt": "2021-03-11T07:19:55Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "oestrada", "title": "Chanel parties it up in ski salopettes for fashion week", "description": "PARIS (Reuters) – Ski lifts may be closed in France due to COVID-19 restrictions, but Chanel recreated a winter resort ambiance on Tuesday with a collection featuring quilted salopettes and faux fur boots fit for a night out after hitting the slopes. The Fren…", "url": "https://lifestyle.inquirer.net/?p=380249", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Bildschirmfoto-2021-03-11-um-14.46.47.png", "publishedAt": "2021-03-11T06:55:24Z", "content": "PARIS (Reuters) – Ski lifts may be closed in France due to COVID-19 restrictions, but Chanel recreated a winter resort ambiance on Tuesday with a collection featuring quilted salopettes and faux fur … [+1724 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dmorcoso", "title": "Olongapo logs 6 new COVID-19 cases", "description": "OLONGAPO CITY –– Six new cases of the coronavirus disease (COVID-19) were recorded in this city on Wednesday, raising its total number of patients to 1,076 since last year. In a statement, Mayor Rolen Paulino Jr. said some of the new infections were traced to…", "url": "https://newsinfo.inquirer.net/?p=1405702", "urlToImage": "https://newsinfo.inquirer.net/files/2020/09/28olongapo-620x319.jpg", "publishedAt": "2021-03-11T06:32:46Z", "content": "OLONGAPO CITY Six new cases of the coronavirus disease (COVID-19) were recorded in this city on Wednesday, raising its total number of patients to 1,076 since last year.\r\nIn a statement, Mayor Rolen … [+1100 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Delfin T. Mallari Jr.", "title": "Quezon taps peoples’ groups in COVID-19 vaccination drive", "description": "LUCENA CITY ---- The provincial government of Quezon has tapped the help of people's organizations to address the widespread public skepticism on the coronavirus disease (COVID-19) vaccination program.\n\nJanet Geneblazo, Quezon public information officer, said…", "url": "https://newsinfo.inquirer.net/1405681/quezon-taps-peoples-groups-in-covid-19-vaccination-drive", "urlToImage": "https://newsinfo.inquirer.net/files/2018/12/quezon-province-map-620x322.png", "publishedAt": "2021-03-11T06:13:42Z", "content": "LUCENA CITY The provincial government of Quezon has tapped the help of peoples organizations to address the widespread public skepticism on the coronavirus disease (COVID-19) vaccination program.\r\nJa… [+3252 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Aquiles Zonio, Divina Suson with reports from Rommel Rebollido, Williamor Magbanua", "title": "Hope, fear, doubts mark initial vaccine rollout in Mindanao", "description": "MLANG, COTABATO ---- Amid her fear of adverse effects, a medical doctor braved the first shots of the CoronaVac on the first day of the vaccine rollout here on Monday and heaved a sigh of relief when she emerged from the inoculation room unscathed.\nDr. Lilian…", "url": "https://newsinfo.inquirer.net/1405689/hope-fear-doubts-mark-initial-vaccine-rollout-in-mindanao", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/Regions128515-620x349.jpg", "publishedAt": "2021-03-11T06:11:47Z", "content": "MLANG, COTABATO Amid her fear of adverse effects, a medical doctor braved the first shots of the CoronaVac on the first day of the vaccine rollout here on Monday and heaved a sigh of relief when she … [+5245 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "lboniol", "title": "Boy, prisoner, 2 elderlies contract COVID-19 in San Pablo City", "description": "LUCENA CITY –- A year-old boy, a jail inmate, and two elderlies were among the 12 new coronavirus disease (COVID-19) patients recorded in San Pablo City in Laguna province on Wednesday, local authorities said. The San Pablo City Anti-COVID-19 Task Force, in a…", "url": "https://newsinfo.inquirer.net/1405642/boy-prisoner-2-elderlies-contract-covid-19-in-san-pablo-city", "urlToImage": "https://newsinfo.inquirer.net/files/2021/01/Untitled-design-620x413.png", "publishedAt": "2021-03-11T04:56:38Z", "content": "LUCENA CITY - A year-old boy, a jail inmate, and two elderlies were among the 12 new coronavirus disease (COVID-19) patients recorded in San Pablo City in Laguna province on Wednesday, local authorit… [+1505 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "oestrada", "title": "BAFTA nominations see diversity push, ‘Nomadland’ and ‘Rocks’ lead nods", "description": "LONDON (Reuters) – U.S. recession drama “Nomadland” and coming-of-age story “Rocks” led the nominations for the British Academy of Film and Television Arts (BAFTA) awards on Tuesday with seven nods each, with a clear push on diversity among the acting contend…", "url": "https://lifestyle.inquirer.net/?p=380233", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/2021-03-09T144627Z_1_LYNXMPEH280X3_RTROPTP_4_AWARDS-BAFTA-NOMINATONS-scaled.jpg", "publishedAt": "2021-03-11T04:26:08Z", "content": "LONDON (Reuters) – U.S. recession drama “Nomadland” and coming-of-age story “Rocks” led the nominations for the British Academy of Film and Television Arts (BAFTA) awards on Tuesday with seven nods e… [+2570 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "ilucas", "title": "St. Luke’s Medical Center promotes holistic wellness", "description": "“Health is wealth” — this is what people tell us so that we take care of ourselves in order to live long and enjoy life to the fullest. As we look for ways to stay healthy, it is important to have an ally that will be always there for you in all steps of your…", "url": "https://lifestyle.inquirer.net/380202/st-lukes-medical-center-promotes-holistic-wellness/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/St.-Lukes-1.png", "publishedAt": "2021-03-11T04:14:59Z", "content": "Health is wealth this is what people tell us so that we take care of ourselves in order to live long and enjoy life to the fullest. As we look for ways to stay healthy, it is important to have an all… [+3987 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Madonna Virola", "title": "DTI office in Oriental Mindoro on temporary lockdown", "description": "CITY OF CALAPAN ---- The Department of Trade and Industry (DTI) provincial office in Oriental Mindoro based in this city has been placed on temporary lockdown starting on Wednesday, March 10, until March 20 for contact tracing and disinfection.\n\nThe lockdown …", "url": "https://newsinfo.inquirer.net/1405620/dti-office-in-oriental-mindoro-on-temporary-lockdown", "urlToImage": "https://newsinfo.inquirer.net/files/2017/03/oriental-mindoro-map.jpg", "publishedAt": "2021-03-11T04:12:14Z", "content": "CITY OF CALAPAN The Department of Trade and Industry (DTI) provincial office in Oriental Mindoro based in this city has been placed on temporary lockdown starting on Wednesday, March 10, until March … [+1717 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dlejano", "title": "Royal family contests Harry and Meghan’s racism claims", "description": "LONDON — Britain’s royal family has begun a fight back against racism claims made by Prince Harry and his wife Meghan, indicating the couple’s comments will not go unchallenged as the country divides into partisan camps. A keenly awaited statement from Queen …", "url": "https://lifestyle.inquirer.net/?p=380230", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Front-Page130235-scaled-1.jpg", "publishedAt": "2021-03-11T04:05:28Z", "content": "Britain’s Prince Harry and Meghan, Duchess of Sussex, are interviewed by Oprah Winfrey in this undated handout photo. Harpo Productions/Joe Pugliese/Handout via REUTERS\r\nLONDON Britain’s royal family… [+5141 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Royal family contests Harry and Meghan’s racism claims", "description": "LONDON --- Britain's royal family has begun a fight back against racism claims made by Prince Harry and his wife Meghan, indicating the couple's comments will not go unchallenged as the country divides into partisan camps.\n\nA keenly awaited statement from Que…", "url": "https://lifestyle.inquirer.net/380230/royal-family-contests-harry-and-meghans-racism-claims", "urlToImage": null, "publishedAt": "2021-03-11T04:05:28Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dmondragon", "title": "Rainy weather expected over Cebu due to LPA", "description": "DALAGUETE, Cebu—Cebu is expected to experience rainy weather due to the extension of a low-pressure area (LPA) spotted 465 kilometers east of General Santos City in Mindanao as of 10 a.m. on Thursday, March 11, 2021. Mark Gales, meteorologist of Philippine At…", "url": "https://cebudailynews.inquirer.net/367111/rainy-weather-expected-over-cebu-due-to-lpa", "urlToImage": null, "publishedAt": "2021-03-11T03:53:54Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dlejano", "title": "UK royal crisis: ‘Firm’ safe for now but clouds loom", "description": "LONDON — The British monarchy’s immediate survival is assured, despite Prince Harry and his wife Meghan’s claims of racism, experts say, but cultural rifts exposed by the row could signal trouble ahead. The revelations are a “soft-power disaster for Britain” …", "url": "https://lifestyle.inquirer.net/380224/uk-royal-crisis-firm-safe-for-now-but-clouds-loom/", "urlToImage": null, "publishedAt": "2021-03-11T03:14:01Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "postie", "title": "San Juan logs 133 new active COVID-19 cases in 10 days", "description": "MANILA, Philippines — The number of active COVID-19 cases in San Juan City has rose by 133 in a span of just 10 days, its mayor said Thursday. San Juan Mayor Francis Zamora said the city has 196 active cases as of Wednesday, March 10. “Last Feb.. 17, we were …", "url": "https://newsinfo.inquirer.net/1405582/san-juan-logs-133-new-active-covid-19-cases-in-10-days", "urlToImage": "https://newsinfo.inquirer.net/files/2019/03/20190326-San-Juan-City-Hall-620x361.jpg", "publishedAt": "2021-03-11T01:59:46Z", "content": "The implementation of the curfew is basically a psychological  reminder to people that Hey, guys, were experiencing a spike, please change your mindset, do not relax, do not be confident just because… [+769 chars]"}]}