{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Queen Elizabeth makes first appearance since Harry and Meghan interview", "description": "LONDON - Britain's Queen Elizabeth has made her first appearance since a tell-all interview by grandson Prince Harry and his wife Meghan rocked the monarchy, but made no reference to the crisis it had caused her family.\n\nDuring the Oprah Winfrey interview, Me…", "url": "https://lifestyle.inquirer.net/?p=380347", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/2021-03-12T184712Z_2_LYNXMPEH2B1FN_RTROPTP_4_BRITAIN-ROYALS-QUEEN.jpg", "publishedAt": "2021-03-12T22:19:12Z", "content": "Britain’s Queen Elizabeth II attends a virtual science showcase to mark British Science Week in this screenshot provided by the Royal Communications on March 12, 2021. Buckingham Palace/Handout via R… [+2122 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "clopez", "title": "Kiko on Sharon having a young leading man; Boy on Gerald’s ‘big reveal’", "description": "Move over, Madonna’s “Like A Virgin.” Here comes Sharon Cuneta in “Revirginized.” The risqué movie, directed by Darryl Yap, serves as the Megastar’s Viva Films comeback. As we face the new normal, Sharon dares to try a “new, unusual” project. It only goes to …", "url": "https://entertainment.inquirer.net/405510/kiko-on-sharon-having-a-young-leading-man-boy-on-geralds-big-reveal", "urlToImage": null, "publishedAt": "2021-03-12T16:20:09Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Agence France-Presse", "title": "WHO says no reason to stop using AstraZeneca jab", "description": "GENEVA --- The World Health Organization (WHO) said Friday there was no reason to stop using AstraZeneca's COVID-19 vaccine after several countries suspended the rollout over blood clot fears.\n\nThe WHO, which said its vaccines advisory committee was examining…", "url": "https://newsinfo.inquirer.net/1406326/who-says-no-reason-to-stop-using-astrazeneca-jab", "urlToImage": "https://newsinfo.inquirer.net/files/2021/02/2021-02-10-WHO-building-in-Switzerland.jpg", "publishedAt": "2021-03-12T13:42:01Z", "content": "GENEVA The World Health Organization (WHO) said Friday there was no reason to stop using AstraZeneca’s COVID-19 vaccine after several countries suspended the rollout over blood clot fears.\r\nThe WHO, … [+4040 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "kadraneda", "title": "Texas Attorney General sues Austin officials over not lifting mask mandate", "description": "The Attorney General for Texas is suing officials in Austin after they refused to enforce an order that ended a statewide mask mandate. Texas announced the lifting of that restriction – which had made mask-wearing compulsory in public buildings and many outdo…", "url": "https://newsinfo.inquirer.net/1406301/texas-attorney-general-sues-austin-officials-over-not-lifting-mask-mandate", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/2021-03-12T111846Z_3_LYNXMPEH2B0O6_RTROPTP_4_HEALTH-CORONAVIRUS-USA-TEXAS-620x414.jpg", "publishedAt": "2021-03-12T12:35:58Z", "content": "FILE PHOTO: A sign promotes mask-wearing at a bar as the state of Texas prepares to lift its mask mandate and reopen businesses to full capacity during the coronavirus disease (COVID-19) pandemic in … [+2215 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "blozada", "title": "US States seek curbs on transgender girls in sports, inflaming U.S. culture war", "description": "(Reuters) – Grace Walker, 17, was captain of the girls’ tennis team at her Minnesota high school until the coronavirus pandemic wiped out her season. Now her state is one of 20 across the country where lawmakers want to block transgender athletes like her fro…", "url": "https://sports.inquirer.net/417815/us-states-seek-curbs-on-transgender-girls-in-sports-inflaming-u-s-culture-war", "urlToImage": "https://sports.inquirer.net/files/2021/03/2021-03-12T111003Z_2_LYNXMPEH2B0Q1_RTROPTP_4_USA-LGBTQ-SPORTS-scaled.jpg", "publishedAt": "2021-03-12T11:44:54Z", "content": "FILE PHOTO: A person holds up a flag during rally to protest the Trump administration’s reported transgender proposal to narrow the definition of gender to male or female at birth, at City Hall in Ne… [+5044 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "postie", "title": "OSG closes premises from March 12-16 as six staff contract COVID-19", "description": "MANILA, Philippines — The Office of the Solicitor General (OSG) would again shut its premises to prevent the further spread of the new coronavirus disease. From March 12 to 16, the OSG will be closed to the public as six of its employees have tested positive …", "url": "https://newsinfo.inquirer.net/1406258/osg-closes-premises-from-march-12-16-as-six-staff-contract-covid-19", "urlToImage": "https://newsinfo.inquirer.net/files/2019/04/1200px-Office_of_the_Solicitor_General_of_the_Philippines_OSG.svg_-620x620.png", "publishedAt": "2021-03-12T10:40:02Z", "content": "MANILA, Philippines The Office of the Solicitor General (OSG) would again shut its premises to prevent the further spread of the new coronavirus disease.\r\nFrom March 12 to 16, the OSG will be closed … [+1344 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Reuters", "title": "South Africa could get 20 million more J&J vaccine doses, says minister", "description": "CAPE TOWN --- The South African government's agreement with Johnson & Johnson for 11 million COVID-19 vaccine doses includes an option for an additional 20 million doses depending on the availability of stock, its health minister said.\n\n\"The agreement has bee…", "url": "https://newsinfo.inquirer.net/1406237/south-africa-could-get-20-million-more-jj-vaccine-doses-says-minister", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/2021-02-28T203114Z_2_LYNXNPEH1R0AC_RTROPTP_4_HEALTH-CORONAVIRUS-VACCINE-JOHNSON-JOHNSON-620x405.jpg", "publishedAt": "2021-03-12T09:25:32Z", "content": "CAPE TOWN The South African government’s agreement with Johnson &amp; Johnson for 11 million COVID-19 vaccine doses includes an option for an additional 20 million doses depending on the availability… [+1750 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "oestrada", "title": "Can Italy’s Dante have justice, 700 years after his death?", "description": "Dante’s “Divine Comedy,” considered one of the world’s greatest literary works, came to light after a miscarriage of justice which Italian legal experts now want to correct — some seven centuries on. The man whom Italians call the “Supreme Poet” was exiled fr…", "url": "https://lifestyle.inquirer.net/380339/can-italys-dante-have-justice-700-years-after-his-death/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/000_94R6W9-scaled.jpg", "publishedAt": "2021-03-12T09:12:45Z", "content": "Dante’s “Divine Comedy,” considered one of the world’s greatest literary works, came to light after a miscarriage of justice which Italian legal experts now want to correct — some seven centuries on.… [+4081 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Cathrine Gonzales", "title": "PH’s COVID-19 active cases top 50,000 anew; per day infections hit another record high at 4,578", "description": "MANILA, Philippines --- Active COVID-19 cases in the country have again breached the 50,000-mark on Friday as the Philippines likewise logged another record high of 4,578 new infections in a day.\n\nThe Department of Health (DOH) reported that COVID-19 active c…", "url": "https://newsinfo.inquirer.net/1406214/phs-covid-19-active-cases-top-50000-anew-per-day-infections-hit-another-record-high-at-4578", "urlToImage": "https://newsinfo.inquirer.net/files/2020/05/AP20132728571996-620x484.jpg", "publishedAt": "2021-03-12T08:42:28Z", "content": "MANILA, Philippines Active COVID-19 cases in the country have again breached the 50,000-mark on Friday as the Philippines likewise logged another record high of 4,578 new infections in a day.\r\nThe De… [+1813 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Cristina Eloisa Baclig", "title": "DATA: A year of COVID-19 quarantine in PH", "description": "MANILA, Philippines --- Today, March 12, 2021, marks the first anniversary since the Philippines imposed a community quarantine in hopes of controlling the country's COVID-19 cases.\n\nIt has also been months since President Rodrigo Duterte first vowed that lif…", "url": "https://newsinfo.inquirer.net/1406213/fwd-data-a-year-of-covid-19-quarantine-in-ph", "urlToImage": "https://newsinfo.inquirer.net/files/2021/03/checkpoint.jpg", "publishedAt": "2021-03-12T08:29:30Z", "content": "Checkpoint signage is seen as a soldier (R) checks the temperature of a motorist before entering Manila on March 16, 2020, as part of measures to reduce the spread of the COVID-19 pandemic. – The vir… [+12346 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Delfin T. Mallari Jr.", "title": "Cops hold 140 COVID-19 protocol violators in Cavite", "description": "LUCENA CITY ---- Police accosted 140 persons in Cavite province in the last two days for violating health and safety protocols against the coronavirus disease (COVDI-19).\nColonel Marlon Santos, Cavite police chief, said in reports posted by the police public …", "url": "https://newsinfo.inquirer.net/1406197/cops-hold-140-covid-19-protocol-violators-in-cavite", "urlToImage": "https://newsinfo.inquirer.net/files/2020/07/07032020-Remulla-620x413.jpeg", "publishedAt": "2021-03-12T07:26:30Z", "content": "LUCENA CITY Police accosted 140 persons in Cavite province in the last two days for violating health and safety protocols against the coronavirus disease (COVDI-19).\r\nColonel Marlon Santos, Cavite po… [+1720 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "blozada", "title": "Olympics: No Chinese vaccines to be taken by Team Japan, minister says", "description": "TOKYO (Reuters)—Japanese athletes at the Summer Olympics will not be eligible for coronavirus vaccinations offered by China since Japan has not approved the vaccines, Olympics Minister Tamayo Marukawa said on Friday, according to public broadcaster NHK. The C…", "url": "https://sports.inquirer.net/?p=417765", "urlToImage": "https://sports.inquirer.net/files/2021/03/2021-03-12T045941Z_1_LYNXMPEH2B07Y_RTROPTP_4_OLYMPICS-2020-MARUKAWA-scaled.jpg", "publishedAt": "2021-03-12T06:45:02Z", "content": "FILE PHOTO: Japan’s Olympic and Paralympic Games Minister Tamayo Marukawa attends a news conference, amid the coronavirus disease (COVID-19) outbreak, in Tokyo, Japan February 18, 2021. REUTERS/Issei… [+2242 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "vcatibog", "title": "5 Best #NotYourOrdinaryLumpia recipes to try this summer", "description": "Manila, Philippines – March 10, 2021 – In practically every Filipino get-together, there is lumpia, a spring roll made of paper-thin wrapper, stuffed with various savory or sweet fillings. This well-loved dish has recently gone from table to TikTok, thanks to…", "url": "https://lifestyle.inquirer.net/380310/5-best-notyourordinarylumpia-recipes-to-try-this-summer/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/tiktok-scaled.jpg", "publishedAt": "2021-03-12T06:11:57Z", "content": "Manila, Philippines – March 10, 2021 – In practically every Filipino get-together, there is lumpia, a spring roll made of paper-thin wrapper, stuffed with various savory or sweet fillings. This well-… [+2172 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "Joanna Rose Aglibot", "title": "Bataan doctor tests positive for COVID-19", "description": "CABANGAN, Zambales ---- A public hospital doctor residing in this town has tested positive for coronavirus disease (COVID-19) on Thursday, March 11, officials said.\nDr. Noel Bueno, provincial health director, said the 33-year-old male doctor works in a Bataan…", "url": "https://newsinfo.inquirer.net/?p=1406148", "urlToImage": "https://newsinfo.inquirer.net/files/2020/06/old-bataan-capitol-06172020-620x412.jpg", "publishedAt": "2021-03-12T05:28:24Z", "content": "CABANGAN, Zambales A public hospital doctor residing in this town has tested positive for coronavirus disease (COVID-19) on Thursday, March 11, officials said.\r\nDr. Noel Bueno, provincial health dire… [+1160 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "dmorcoso", "title": "Tagaytay has 35 new COVID-19 cases; 25 contract virus in wake", "description": "LUCENA CITY –– Thirty-five new coronavirus disease (COVID-19) cases were recorded in Tagaytay City in Cavite province, 25 of whom contracted the virus in a wake for the dead, local authorities reported Friday, March 12. The local government said in a post on …", "url": "https://newsinfo.inquirer.net/?p=1406133", "urlToImage": "https://newsinfo.inquirer.net/files/2020/05/Regions42512-620x416.jpg", "publishedAt": "2021-03-12T05:07:16Z", "content": "LUCENA CITY Thirty-five new coronavirus disease (COVID-19) cases were recorded in Tagaytay City in Cavite province, 25 of whom contracted the virus in a wake for the dead, local authorities reported … [+1684 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Solon tells PNP: Focus on cleansing ranks, not ‘PDA couples’", "description": "MANILA, Philippines --- The Philippine National Police (PNP) should focus on cleansing its ranks instead of running after couples who engage in public display affection (PDA), a lawmaker said Friday.\n\nPuwersa ng Bayaning Atleta (PBA) Partylist Rep. Jericho No…", "url": "https://newsinfo.inquirer.net/1406093/solon-tells-pnp-focus-on-cleansing-ranks-not-pda-couples", "urlToImage": null, "publishedAt": "2021-03-12T02:58:05Z", "content": null}, {"source": {"id": null, "name": "Inquirer.net"}, "author": "ilucas", "title": "Take a 360 virtual adventure around Hong Kong’s off-the-beaten path outdoor destinations", "description": "Going on an adventure in off-the-beaten path destinations is one the many things Filipinos are looking forward to doing again now that tourism is slowly reopening with travel and safety protocols set in place. Hiking mountains, swimming in beaches, and even c…", "url": "https://lifestyle.inquirer.net/380236/take-a-360-virtual-adventure-around-hong-kongs-off-the-beaten-path-outdoor-destinations/", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/HKTB-Cover.png", "publishedAt": "2021-03-12T02:39:21Z", "content": "Going on an adventure in off-the-beaten path destinations is one the many things Filipinos are looking forward to doing again now that tourism is slowly reopening with travel and safety protocols set… [+3051 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "Nanyang offers authentic and affordable Singaporean rice meal set and noodles", "description": "Nanyang offers all day Asian favorites Homemade Nasi Lemak served with golden crispy chicken chop, sambal sauce, anchovies with peanuts, sliced cucumber, rice and egg. Curry Chicken with Rice P248 rich in flavor with the right amount of spiciness. Hainanese C…", "url": "https://lifestyle.inquirer.net/?p=380280", "urlToImage": "https://lifestyle.inquirer.net/files/2021/03/Screen-Shot-2021-03-11-at-9.04.00-PM-e1615467996378.png", "publishedAt": "2021-03-12T02:00:30Z", "content": "Nanyang offers all day Asian favorites Homemade Nasi Lemak served with golden crispy chicken chop, sambal sauce, anchovies with peanuts, sliced cucumber, rice and egg. Curry Chicken with Rice P248 ri… [+1679 chars]"}]}