[{"date": "2021-03-12", "title": "Queen Elizabeth makes first appearance since Harry and Meghan interview", "article": "Britain’s Queen Elizabeth II attends a virtual science showcase to mark British Science Week in this screenshot provided by the Royal Communications on March 12, 2021. Buckingham Palace/Handout via R… [+2122 chars]", "author": null}, {"date": "2021-03-12", "title": "Kiko on Sharon having a young leading man; Boy on Gerald’s ‘big reveal’", "article": null, "author": "clopez"}, {"date": "2021-03-12", "title": "WHO says no reason to stop using AstraZeneca jab", "article": "GENEVA The World Health Organization (WHO) said Friday there was no reason to stop using AstraZeneca’s COVID-19 vaccine after several countries suspended the rollout over blood clot fears.\r\nThe WHO, … [+4040 chars]", "author": "Agence France-Presse"}, {"date": "2021-03-12", "title": "Texas Attorney General sues Austin officials over not lifting mask mandate", "article": "FILE PHOTO: A sign promotes mask-wearing at a bar as the state of Texas prepares to lift its mask mandate and reopen businesses to full capacity during the coronavirus disease (COVID-19) pandemic in … [+2215 chars]", "author": "kadraneda"}, {"date": "2021-03-12", "title": "US States seek curbs on transgender girls in sports, inflaming U.S. culture war", "article": "FILE PHOTO: A person holds up a flag during rally to protest the Trump administration’s reported transgender proposal to narrow the definition of gender to male or female at birth, at City Hall in Ne… [+5044 chars]", "author": "blozada"}, {"date": "2021-03-12", "title": "OSG closes premises from March 12-16 as six staff contract COVID-19", "article": "MANILA, Philippines The Office of the Solicitor General (OSG) would again shut its premises to prevent the further spread of the new coronavirus disease.\r\nFrom March 12 to 16, the OSG will be closed … [+1344 chars]", "author": "postie"}, {"date": "2021-03-12", "title": "South Africa could get 20 million more J&J vaccine doses, says minister", "article": "CAPE TOWN The South African government’s agreement with Johnson &amp; Johnson for 11 million COVID-19 vaccine doses includes an option for an additional 20 million doses depending on the availability… [+1750 chars]", "author": "Reuters"}, {"date": "2021-03-12", "title": "Can Italy’s Dante have justice, 700 years after his death?", "article": "Dante’s “Divine Comedy,” considered one of the world’s greatest literary works, came to light after a miscarriage of justice which Italian legal experts now want to correct — some seven centuries on.… [+4081 chars]", "author": "oestrada"}, {"date": "2021-03-12", "title": "PH’s COVID-19 active cases top 50,000 anew; per day infections hit another record high at 4,578", "article": "MANILA, Philippines Active COVID-19 cases in the country have again breached the 50,000-mark on Friday as the Philippines likewise logged another record high of 4,578 new infections in a day.\r\nThe De… [+1813 chars]", "author": "Cathrine Gonzales"}, {"date": "2021-03-12", "title": "DATA: A year of COVID-19 quarantine in PH", "article": "Checkpoint signage is seen as a soldier (R) checks the temperature of a motorist before entering Manila on March 16, 2020, as part of measures to reduce the spread of the COVID-19 pandemic. – The vir… [+12346 chars]", "author": "Cristina Eloisa Baclig"}, {"date": "2021-03-12", "title": "Cops hold 140 COVID-19 protocol violators in Cavite", "article": "LUCENA CITY Police accosted 140 persons in Cavite province in the last two days for violating health and safety protocols against the coronavirus disease (COVDI-19).\r\nColonel Marlon Santos, Cavite po… [+1720 chars]", "author": "Delfin T. Mallari Jr."}, {"date": "2021-03-12", "title": "Olympics: No Chinese vaccines to be taken by Team Japan, minister says", "article": "FILE PHOTO: Japan’s Olympic and Paralympic Games Minister Tamayo Marukawa attends a news conference, amid the coronavirus disease (COVID-19) outbreak, in Tokyo, Japan February 18, 2021. REUTERS/Issei… [+2242 chars]", "author": "blozada"}, {"date": "2021-03-12", "title": "5 Best #NotYourOrdinaryLumpia recipes to try this summer", "article": "Manila, Philippines – March 10, 2021 – In practically every Filipino get-together, there is lumpia, a spring roll made of paper-thin wrapper, stuffed with various savory or sweet fillings. This well-… [+2172 chars]", "author": "vcatibog"}, {"date": "2021-03-12", "title": "Bataan doctor tests positive for COVID-19", "article": "CABANGAN, Zambales A public hospital doctor residing in this town has tested positive for coronavirus disease (COVID-19) on Thursday, March 11, officials said.\r\nDr. Noel Bueno, provincial health dire… [+1160 chars]", "author": "Joanna Rose Aglibot"}, {"date": "2021-03-12", "title": "Tagaytay has 35 new COVID-19 cases; 25 contract virus in wake", "article": "LUCENA CITY Thirty-five new coronavirus disease (COVID-19) cases were recorded in Tagaytay City in Cavite province, 25 of whom contracted the virus in a wake for the dead, local authorities reported … [+1684 chars]", "author": "dmorcoso"}, {"date": "2021-03-12", "title": "Solon tells PNP: Focus on cleansing ranks, not ‘PDA couples’", "article": null, "author": null}, {"date": "2021-03-12", "title": "Take a 360 virtual adventure around Hong Kong’s off-the-beaten path outdoor destinations", "article": "Going on an adventure in off-the-beaten path destinations is one the many things Filipinos are looking forward to doing again now that tourism is slowly reopening with travel and safety protocols set… [+3051 chars]", "author": "ilucas"}, {"date": "2021-03-12", "title": "Nanyang offers authentic and affordable Singaporean rice meal set and noodles", "article": "Nanyang offers all day Asian favorites Homemade Nasi Lemak served with golden crispy chicken chop, sambal sauce, anchovies with peanuts, sliced cucumber, rice and egg. Curry Chicken with Rice P248 ri… [+1679 chars]", "author": null}]